{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "ZeroPadding2D", "config": {"padding": [4, 4], "batch_input_shape": [null, 17, 19, 19], "trainable": true, "name": "zeropadding2d_1", "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_9", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_10", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_11", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_12", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 67712, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 361}}]}